Revit 2026 API

# ApplicationNewProjectDocument(String) Method

---

New project document

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Document NewProjectDocument(
	string templateFileName
)
```
```vb
Public Overridable Function NewProjectDocument (
	templateFileName As String
) As Document
```
```cpp
public:
virtual Document^ NewProjectDocument(
	String^ templateFileName
)
```
```fsharp
abstract NewProjectDocument :
        templateFileName : string -> Document
override NewProjectDocument :
        templateFileName : string -> Document
```

#### Parameters

templateFileName String
    The template file name.

#### Return Value

Document

| Exception | Condition |
| --- | --- |
| ArgumentException | If 'templateFileName' is  or an empty string. |
| InvalidOperationException | If the new project document cannot be created. |

This command corresponds to New->Project command in the user-interface.

#### Reference

Application Class

NewProjectDocument Overload

Autodesk.Revit.ApplicationServices Namespace